TestExample/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.035 -0.01 -0.03)
    (0.035 -0.01 -0.03)
    (0.035 0.06 -0.03)
    (-0.035 0.06 -0.03)
    (-0.035 -0.01 0.03)
    (0.035 -0.01 0.03)
    (0.035 0.06 0.03)
    (-0.035 0.06 0.03)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
);

edges
(
);

boundary 
(
    boundary
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (4 5 6 7)
            (0 3 2 1)
        );
    }

    input1 
    {
        type wall;
        faces
        (
            (4 7 3 0) 
        );
    }

    input2 
    {
        type wall;
        faces
        (
            (2 6 5 1) 
        );
    }

    output
    {
        type wall;
        faces
        (
            (0 1 5 4) 
        );
    }
);